# parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10.75,14.6, 12.25,18.6, 14.25,17.3]  # P3/8
  - [15,20.8, 16.5,24.8, 18.25,21.7]  # P4/16
  - [20.75,28.4, 27.75,40.4, 38.75,56.8]  # P5/32
#  - [4,5,  8,10,  13,16]  # P3/8
#  - [23,29,  43,55,  73,105]  # P4/16
#  - [146,217,  231,300,  335,433]  # P5/32


# YOLOv5 backbone: mobilenet v2
backbone:

  # [from, number, module, args]
  [
   [-1, 1, Conv3x3BNActivation, [16,2]],
   [ -1, 1, MV2Block, [ 32, 1 ,4] ], # 1-P3/8
   [ -1, 1, MV2Block, [ 64, 2 ,4] ], # 2
   [ -1, 2, MV2Block, [ 64, 1 ,4] ], # 3-P4/16,
   [ -1, 1, MV2Block, [ 128, 2 ,4] ],#4
   [ -1, 1, MobileViTBlock, [ 144, 2 ,128,288] ], # 5-P5/32
   [ -1, 1, MV2Block, [ 128,2 ,4] ], # 6         80
   [-1, 1, MobileViTBlock, [192,4,128,768]],  #7 output p4  6                 40
   [-1, 1, MV2Block, [160, 2,4]],  # 8                  80
   [-1, 1, MobileViTBlock, [240,4,160,960]], #9                   40
   [-1, 1, Conv1x1BNActivation, [640]],#10
#   [-1, 1, CoordAtt, [640]]

  ]

# YOLOv5 head
head:
  [
    [ -1, 1, Conv, [ 128, 1, 1 ] ],#11
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 6 ], 1, Concat, [ 1 ] ],  # cat backbone P4
    [ -1, 1, CBAMC3, [ 128, False ] ],  # 14

    [ -1, 1, Conv, [ 128, 1, 1 ] ],#15
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 4 ], 1, Concat, [ 1 ] ],  # cat backbone P3
    [ -1, 1, CBAMC3, [ 128, False ] ],  # 18 (P3/8-small)

    [ -1, 1, Conv, [ 128, 3, 2 ] ],
    [ [ -1, 15  ], 1, Concat, [ 1 ] ],  # cat head P4
    [ -1, 1, CBAMC3, [ 128, False ] ],  # 17 (P4/16-medium)

    [ -1, 1, Conv, [ 128, 3, 2 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 7 ], 1, Concat, [ 1 ] ],  # cat head P5
    [ -1, 1, CBAMC3 , [ 128, False ] ],  # 20 (P5/32-large)

    [ [ 14, 17, 20 ], 1, Detect, [ nc, anchors ] ],  # Detect(P3, P4, P5)
  ]

